; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_2 type_1)
 (:predicates (pred_4 ?v3 - type_2 ?v5 - type_3)
 	      (pred_2 ?v2 - object ?v5 - type_3)
	      (pred_1 ?v3 - type_2 ?v1 - type_1)
	      (pred_3 ?v3 - type_2 ?v2 - object ?v1 - type_1))

   (:action op_2
       :parameters  (?v3 - type_2 ?v6 ?v4 - type_3)
       :precondition (and  (pred_4 ?v3 ?v6))
       :effect (and  (pred_4 ?v3 ?v4)
		     (not (pred_4 ?v3 ?v6))))

   (:action op_3
       :parameters (?v3 - type_2 ?v7 - object ?v8 - type_3 ?v1 - type_1)
       :precondition  (and  (pred_2 ?v7 ?v8) (pred_4 ?v3 ?v8) (pred_1 ?v3 ?v1))
       :effect (and (pred_3 ?v3 ?v7 ?v1)
		    (not (pred_2 ?v7 ?v8)) 
		    (not (pred_1 ?v3 ?v1))))

   (:action op_1
       :parameters (?v3 - type_2 ?v7 - object ?v8 - type_3 ?v1 - type_1)
       :precondition  (and  (pred_3 ?v3 ?v7 ?v1) (pred_4 ?v3 ?v8))
       :effect (and (pred_2 ?v7 ?v8)
		    (pred_1 ?v3 ?v1)
		    (not (pred_3 ?v3 ?v7 ?v1)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_02 obj_05 - type_2
obj_01 obj_12 obj_08 obj_11 - type_1
obj_04 obj_09 obj_03 obj_07 - type_3
obj_10 obj_13 obj_06 - object)
(:init
(pred_4 obj_02 obj_03)
(pred_1 obj_02 obj_01)
(pred_1 obj_02 obj_12)
(pred_4 obj_05 obj_07)
(pred_1 obj_05 obj_08)
(pred_1 obj_05 obj_11)
(pred_2 obj_10 obj_09)
(pred_2 obj_13 obj_03)
(pred_2 obj_06 obj_07)
)
(:goal
(and
(pred_2 obj_10 obj_09)
(pred_2 obj_13 obj_04)
(pred_2 obj_06 obj_07)
)
)

(:constraints
  (always (not (pred_4 obj_02 obj_04)))
)
)

; plan
1. (op_2 obj_05 obj_07 obj_03)
   deleted: (pred_4 obj_05 obj_07)
   added: (pred_4 obj_05 obj_03)
   goals met: 2 of 3
2. (op_3 obj_05 obj_13 obj_03 obj_11)
   deleted: (pred_2 obj_13 obj_03) (pred_1 obj_05 obj_11)
   added: (pred_3 obj_05 obj_13 obj_11)
   goals met: 2 of 3
3. (op_2 obj_05 obj_03 obj_04)
   deleted: (pred_4 obj_05 obj_03)
   added: (pred_4 obj_05 obj_04)
   goals met: 2 of 3
4. (op_1 obj_05 obj_13 obj_04 obj_11)
   deleted: (pred_3 obj_05 obj_13 obj_11)
   added: (pred_2 obj_13 obj_04) (pred_1 obj_05 obj_11)
   goals met: 3 of 3
